tutorials/PlateFinNew/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


fluid
{
    // Density 
    rho             rho [1 -3 0 0 0 0 0] 997.3;

    // Viscosity
    mu              mu [ 1 -1 -1 0 0 0 0 ] 8.9e-4; 
}

// ************************************************************************* //

