tutorials/PlateFinNew/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
        minIter         	2;
        maxIter         	50;
    };

/*    T*/
/*    {*/
/*        solver          PBiCG;*/
/*        preconditioner  diagonal;*/
/*        tolerance       1e-15;*/
/*        relTol          1e-2;*/
/*        minIter         2;*/
/*        maxIter         50;*/
/*    };*/

    p
    {
        solver          BICCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }

    pcorr
    {
        solver          BiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }

    pFinal
    {
        solver          BICCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        minIter         2;
        maxIter         1000;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        T               1e-4;
    }
}

PISO
{
    pRefPoint (0.0015 0.0003 0.001); 
    pRefValue 0;
}

PIMPLE
{
    // p-U coupling
    nOuterCorrectors            3; // SIMPLEC loops
    nCorrectors                 1; // PISO loops
    nNonOrthogonalCorrectors    1;
}

relaxationFactors
{
	T	1.0;
}



// ************************************************************************* //
